app/Controllers/UserApiController.php

	public function create()
	{
		$users = new User();

		$data = [
			'name' => $this->request->getVar('name'),
			'email' => $this->request->getVar('email'),
			'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
		];

		$is_email = $users->where('email', $this->request->getVar('email'))->first();
		if ($is_email) {
			return $this->respondCreated([
				'status' => 0,
				'message' => 'Email already exists'
			]);
		} else {
			$result = $users->save($data);
---
SELECT *
FROM `users`
WHERE `email` = 'clara@gmail.com'
 LIMIT 1
INSERT INTO `users` (`name`, `email`, `password`) VALUES ('Clara', 'clara@gmail.com', '$2y$10$3vhEtRN6EgQXzz2WPcuvS.39YJYzA/tdEgGBQeCtJMEzW7JCBNzRW')

	public function login()
	{
		$users = new User();
		$email = $this->request->getVar('email');
		$password = $this->request->getVar('password');
		$is_email = $users->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'clara@gmail.com'
 LIMIT 1